Revit 2026 API

# DuctSizeSettingIterator Class

---

An iterator to a set of items from DuctSizeSettings. Each item is a KeyValuePair(DuctShape::Enum, DuctSizes).

SystemObject Autodesk.Revit.DB.MechanicalDuctSizeSettingIterator

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
```
```vb
Public Class DuctSizeSettingIterator
	Implements IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
```
```cpp
public ref class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>
```
```fsharp
type DuctSizeSettingIterator =
    class
        interface IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
    end
```

The DuctSizeSettingIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuctSizeSettingIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasCurrent | Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done. |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the enumerator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace